package com.example.muslimguide;

import android.os.Bundle;

import androidx.fragment.app.Fragment;

import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;
import android.widget.TextView;

import java.util.concurrent.ThreadLocalRandom;

/**
 * A simple {@link Fragment} subclass.
 * Use the {@link Duaa#newInstance} factory method to
 * create an instance of this fragment.
 */
public class Duaa extends Fragment {

    // TODO: Rename parameter arguments, choose names that match
    // the fragment initialization parameters, e.g. ARG_ITEM_NUMBER
    private static final String ARG_PARAM1 = "param1";
    private static final String ARG_PARAM2 = "param2";

    // TODO: Rename and change types of parameters
    private String mParam1;
    private String mParam2;

    public Duaa() {
        // Required empty public constructor
    }

    /**
     * Use this factory method to create a new instance of
     * this fragment using the provided parameters.
     *
     * @param param1 Parameter 1.
     * @param param2 Parameter 2.
     * @return A new instance of fragment Duaa.
     */
    // TODO: Rename and change types and number of parameters
    public static Duaa newInstance(String param1, String param2) {
        Duaa fragment = new Duaa();
        Bundle args = new Bundle();
        args.putString(ARG_PARAM1, param1);
        args.putString(ARG_PARAM2, param2);
        fragment.setArguments(args);
        return fragment;
    }

    @Override
    public void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        if (getArguments() != null) {
            mParam1 = getArguments().getString(ARG_PARAM1);
            mParam2 = getArguments().getString(ARG_PARAM2);
        }
    }


    int random = ThreadLocalRandom.current().nextInt(0, 10);
    String[] items = new String[]{
            "- { رَبَّنَا لا تُؤَاخِذْنَا إِنْ نَسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا رَبَّنَا وَلا تُحَمِّلْنَا مَا لا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلانَا فَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ} البقرة الآية : 286\n" +
                    "- {ر َبَّنَا لا تُزِغْ قُلُوبَنَا بَعْدَ إِذْ هَدَيْتَنَا وَهَبْ لَنَا مِنْ لَدُنْكَ رَحْمَةً إِنَّكَ أَنْتَ الْوَهَّابُ} آل عمران آية 8\n" +
                    "- { رَبَّنَا إِنَّنَا سَمِعْنَا مُنَادِيًا يُنَادِي للإيمَانِ أَنْ آمِنُوا بِرَبِّكُمْ فَآمَنَّا رَبَّنَا فَاغْفِرْ لَنَا ذُنُوبَنَا وَكَفِّرْ عَنَّا سَيِّئَاتِنَا وَتَوَفَّنَا مَعَ الأبْرَارِ * رَبَّنَا وَآتِنَا مَا َوعَدْتَنَا عَلَى رُسُلِكَ ولا تُخْزِنَا يَوْمَ الْقِيَامَةِ إِنَّكَ لا تُخْلِفُ ا لْمِيعَادَ} آل عمران الآية : 193-194 \n" +
                    "- اللَّهُمَّ رب اغفر لي خطيئتي وجهلي وإسرافي في أمري ، وما أنت أعلم به مني، اللهم اغفر لي جدي وهزلي ، وخطئي وعمدي ، وكل ذلك عندي ، اللهم اغفر لي ما قدمت ، وما أخرت ، وما أسررت ، وما أعلنت، وما أنت أعلم به مني ، أنت المقدم، وأنت المؤخر ، وأنت على كل شيء قدير. \n" +
                    "- رب أعني ، ولا تعن علي ، وانصرني ،ولا تنصر علي، وامكر لي، ولا تمكر علي ، واهدني ، ويسر الهدى لي ، وانصرني على من بغي علي، رب اجعلني لك ذكاراً ، لك شاكراً ، لك مطواعًا ، لك مخبتًا ، إليك أواهًا منيبًا ، رب تقبل توبتي ، واغسل حوبتي . \n" +
                    "- اللَّهُمَّ إني أسألك بأن لك الحمد، لا إله إلا أنت ، وحدك لا شريك لك ، المنان، يا بديع السموات والأرض ، يا ذا الجلال والإكرام، يا حي يا قيوم إني أسألك الجنة وأعوذ بك من النار. "


                               ,

            "- {رَبَّنَا إِنَّنَا آمَنَّا فَاغْفِرْ لَنَا ذُنُوبَنَا وَقِنَا عَذَابَ النَّارِ} آل عمران الآية : 16\n" +
                    "- { رَبَّنَا اغْفِرْ لَنَا ذُنُوبَنَا وَإِسْرَافَنَا فِي أَمْرِنَا وَثَبِّتْ أَقْدَامَنَا وَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ}آل عمران الآية : 147\n" +
                    "- { رَبَّنَا ظَلَمْنَا أَنفُسَنَا وَإِنْ لَمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُونَنَّ مِنْ الْخَاسِرِينَ } الأعراف الآية: 23\n" +
                    "- اللَّهُمَّ إني أسألك يا الله الأحد الصمد الذي لم يلد ولم يولد ولم يكن له كفوا أحد أن تغفر لي ذنوبي إنك أنت الغفور الرحيم .\n" +
                    "- اللَّهُمَّ رحمتك أرجو فلا تكلني إلى نفسي طرفة عين ، وأصلح لي شأني كله ، لا إله إلا أنت.\n" +
                    "- اللَّهُمَّ رب اغفر لي خطيئتي وجهلي وإسرافي في أمري ، وما أنت أعلم به مني، اللهم اغفر لي جدي وهزلي ، وخطئي وعمدي ، وكل ذلك عندي ، اللهم اغفر لي ما قدمت ، وما أخرت ، وما أسررت، وما أعلنت، وما أنت أعلم به مني ، أنت المقدم، وأنت المؤخر ، وأنت على كل شيء قدير. \n" +
                    "- اللَّهُمَّ إني أسألك الجنة وما قرب إليها من قول أو عمل ، وأعوذ بك من النار وما قرب إليها من قول أو عمل ، وأسألك أن تجعل كل قضاء قضيته لي خيراً .\n"


                          ,
            "- { رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَى وَالِدَيَّ وَأَنْ أَعْمَلَ صَالِحًا تَرْضَاهُ وَأَصْلِحْ لِي فِي ذُرِّيَّتِي إِنِّي تُبْتُ إِلَيْكَ وَإِنِّي مِنْ الْمُسْلِمِينَ . } الأحقاف الآية : 15\n" +
                    "- { رَبَّنَا اغْفِر لي وَلِوَالِديَ وَلِلمُؤمِنِينَ يَومَ يَقُومُ الحِسَابُ} إبراهيم الآية : 41\n" +
                    "- { رَبَّنَا هَب لنا مِن أزواجنا وذُرياتنا قُرَّةَ أعيُنٍ واجعلنا للمُتقينَ إمَامًا} الفرقان الآية: 74\n" +
                    "- { رَبِّ هَب لي من لدُنكَ ذُريةً طَيبةً إنكَ سَميعُ الدُّعاءِ} آل عمران الآية : 38\n" +
                    "- اللَّهُمَّ إني أعوذ بك من فتنة النار، وعذاب النار، وفتنة القبر ، وعذاب القبر ، ومن شر فتنة الغنى ، ومن شر فتنة الفقر ، وأعوذ بك من شر فتنة المسيح الدجال ، اللهم اغسل خطاياي بالماء والثلج والبرد ، ونقى قلبي من الخطايا كما نقيت الثوب الأبيض من الدنس ، وباعد بيني وبين خطاياي كما باعدت بين المشرق والمغرب ، اللهم إني أعوذ بك من الكسل والهرم، والمأثم والمغرم .\n" +
                    "- اللَّهُمَّ إني أسألك بأن لك الحمد، لا إله إلا أنت ، وحدك لا شريك لك ، المنان، يا بديع السموات والأرض ، يا ذا الجلال والإكرام، يا حي يا قيوم إني أسألك الجنة وأعوذ بك من النار. \n" +
                    "- اللَّهُمَّ إني أعوذ بك من العجز والكسل والجبن والبخل ، والهرم ، وعذاب القبر ، اللهم آت نفسي تقواها ، وزكها أنت خير من زكاها، أنت وليها ومولاها ، اللهم إني أعوذ بك من علم لا ينفع ، ومن قلب لا يخشع ، ومن نفس لا تشبع ، ومن دعوة لا يستجاب لها ."



            ,
            "- {رَبَّنَا آمَنَّا فَاغْفِرْ لَنَا وَارْحَمْنَا وَأَنْتَ خَيْرُ الرَّاحِمِينَ } المؤمنون الآية: 109.\n" +
                    "- {رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَى وَالِدَيَّ وَأَنْ أَعْمَلَ صَالِحاً تَرْضَاهُ وَأَدْخِلْنِي بِرَحْمَتِكَ فِي عِبَادِكَ الصَّالِحِينَ} النمل الآية: 19.\n" +
                    "- {لا إِلَهَ إِلَّا أَنْتَ سُبْحَانَكَ إِنِّي كُنْتُ مِنَ الظَّالِمِينَ } الأنبياء الآية: 87.\n" +
                    "- {رَبِّ إِنِّي ظَلَمْتُ نَفْسِي فَاغْفِرْ لِي } القصص الآية: 16.\n" +
                    "- رب أعني ، ولا تعن علي ، وانصرني ،ولا تنصر علي، وامكر لي، ولا تمكر علي ، واهدني ، ويسر الهدى لي ، وانصرني على من بغي علي، رب اجعلني لك ذكاراً ، لك شاكراً ، لك مطواعًا ، لك مخبتًا ، إليك أواهًا منيبًا ، رب تقبل توبتي ، واغسل حوبتي . \n" +
                    "- اللَّهُمَّ جدد الإيمان في قلوبنا. \n" +
                    "- اللَّهُمَّ اغفر لي ذنبي ، وخطئي وعمدي، اللهم إني أستهديك لأرشد أمري ، وأعوذ بك من شر نفسي .\n" +
                    "- اللَّهُمَّ أنت ربي ، وأنا عبدك ، ظلمت نفسي، واعترفت بذنبي يارب ، فاغفر لي ذنبي إنك أنت ربى إنه لا يغفر الذنب إلا أنت .\n\n\n\n\n\n\n\n\n\n\n"



            ,
            "- { رَبَّنَا تَقَبَّلْ مِنَّا إِنَّكَ أَنْتَ السَّمِيعُ الْعَلِيمُ * رَبَّنَا وَاجْعَلْنَا مُسْلِمَيْنِ لَكَ وَمِنْ ذُرِّيَّتِنَا أُمَّةً مُسْلِمَةً لَكَ وَأَرِنَا مَنَاسِكَنَا وَتُبْ عَلَيْنَا إنَّكَ أَنْتَ التَّوَّابُ الرَّحِيمُ} البقرة الآية : 127-128\n" +
                    "- { رَبَّنَا لا تَجْعَلْنَا فِتْنَةً لِلْقَوْمِ الظَّالِمِينَ * وَنَجِّنَا بِرَحْمَتِكَ مِنْ الْقَوْمِ الْكَافِرِينَ}يونس آية85-86\n" +
                    "- { رَبَّنَا أَفْرِغْ عَلَيْنَا صَبْرًا وَتَوَفَّنَا مُسْلِمِينَ } الأعراف الآية : 126\n" +
                    "- { رَبَّنَا آتِنَا مِنْ لَدُنْكَ رَحْمَةً وَهَيِّئْ لَنَا مِنْ أَمْرِنَا رَشَدًا } الكهف الآية : 10\n" +
                    "- اللَّهُمَّ لك الحمد أنت قيِّمُ السماوات والأرض ومن فيهن ولك الحمد لك ملك السماوات والأرض ومن فيهن ولك الحمد أنت نور السماوات والأرض ومن فيهن ولك الحمد أنت الحق ووعدك الحق ولقاؤك حق وقولك حق والجنة حق والنار حق و النبيون حق ومحمد صلى الله عليه وسلم حق والساعة حق اللَّهُمَّ لك أسلمت وبك آمنت وعليك توكلت وإليك أنبت وبك خاصمت وإليك حاكمت فاغفر لي ما قدمت وما أخرت وما أسررت وما أعلنت أنت المقدم وأنت المؤخر لا إله إلا أنت . \n" +
                    "- نعوذ بالله من النار ، نعوذ بالله من الفتن ، ما ظهر منها وما بطن نعوذ بالله من فتنة الدجال . \n" +
                    "- اللَّهُمَّ إني أعوذ بك من فتنة النار، وعذاب النار ، ومن شر الغنى والفقر . \n" +
                    "- اللَّهُمَّ إني أعوذ بك أن أشرك بك وأنا أعلم، وأستغفرك لما لا أعلم . \n\n\n\n\n\n\n\n"



            ,
            "- { رَبَّنَا آمَنَّا فَاغْفِرْ لَنَا وَارْحَمْنَا وَأَنْتَ خَيْرُ الرَّاحِمِينَ . } المؤمنون الآية : 109\n" +
                    "- { رَبَّنَا اصْرِفْ عَنَّا عَذَابَ جَهَنَّمَ إِنَّ عَذَابَهَا كَانَ غَرَامًا . } الفرقان الآية : 65\n" +
                    "- { رَبِّ اغْفِرْ وَارْحَمْ وَأَنْتَ خَيْرُ الرَّاحِمِينَ} المؤمنون الآية : 118\n" +
                    "- { رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَى وَالِدَيَّ وَأَنْ أَعْمَلَ صَالِحًا تَرْضَاهُ وَأَدْخِلْنِي بِرَحْمَتِكَ فِي عِبَادِكَ الصَّالِحِينَ} النمل الآية : 19\n" +
                    "- اللَّهُمَّ لك أسلمت ، وبك آمنت، وعليك توكلت ، وإليك أنبت ، وبك خاصمت ، اللهم إني أعوذ بعزتك، لا إله أنت ، أن تضلني ، أنت الحي الذي لا يموت ، والجن والإنس يموتون . \n" +
                    "- اللَّهُمَّ إني أسألك الفردوس الأعلى من الجنة. \n" +
                    "- اللَّهُمَّ آت نفسي تقواها وزكها أنت خير من زكاها أنت وليها ومولاها .\n" +
                    "- اللَّهُمَّ أحسن عاقبتنا في الأمور كلها وأجرنا من خزي الدنيا وعذاب الآخرة . \n" +
                    "- اللَّهُمَّ أحيني ما كانت الحياة خيرًا لي وتوفني إذا كانت الوفاة خيرًا لي . \n" +
                    "- اللَّهُمَّ أحيني مسكينًا وأمتني مسكينًا واحشرني في زمرة المساكين .\n" +
                    "- اللَّهُمَّ أسألك العفو والعافية في ديني ودنياي وأهلي ومالي . \n" +
                    "- اللَّهُمَّ أعني على ذكرك وشكرك وحسن عبادتك .\n" +
                    "- اللَّهُمَّ أسألك علمًا نافعًا ورزقًا واسعًا وشفاء من كل داء \n\n\n\n\n\n\n\n"




            ,
            "- { رَبِّ اجْعَلْنِي مُقِيمَ الصَّلاةِ وَمِنْ ذُرِّيَّتِي رَبَّنَا وَتَقَبَّلْ دُعَاءِ . رَبَّنَا اغْفِرْ لِي وَلِوَالِدَيَّ وَلِلْمُؤْمِنِينَ يَوْمَ يَقُومُ الْحِسَابُ }إبراهيم الآيتان: 40-41.\n" +
                    "- { رَبَّنَا وَسِعْتَ كُلَّ شَيْءٍ رَحْمَةً وَعِلْمًا فَاغْفِرْ لِلَّذِينَ تَابُوا وَاتَّبَعُوا سَبِيلَكَ وَقِهِمْ عَذَابَ الْجَحِيمِ * رَبَّنَا وَأَدْخِلْهُمْ جَنَّاتِ عَدْنٍ الَّتِي وَعَدْتَهُم وَمَنْ صَلَحَ مِنْ آبَائِهِمْ وَأَزْوَاجِهِمْ وَذُرِّيَّاتِهِمْ إِنَّكَ أَنْتَ الْعَزِيزُ الْحَكِيمُ}غافر الآية : 7-8\n" +
                    "- {رَبَّنَا أَتْمِمْ لَنَا نُورَنَا وَاغْفِرْ لَنَا إِنَّكَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ } التحريم الآية: 8.\n" +
                    "- اللهم اقسم لنا من خشيتك ما يحول بيننا وبين معاصيك ومن طاعتك ما تبلغنا به جنتك ومن اليقين ما تهون به علينا مصيبات الدنيا ومتعنا بأسماعنا وأبصارنا وقوتنا ما أحييتنا واجعله الوارث منا واجعل ثأرنا على من ظلمنا وانصرنا على من عادانا ولا تجعل مصيبتنا في ديننا ولا تجعل الدنيا أكبر همنا ولا مبلغ علمنا ولا تسلط علينا من لا يرحمنا.\n" +
                    "- اللَّهُمَّ بعلمك الغيب وقدرتك على الخلق أحيني ما علمت الحياة خيرًا لي وتوفني إذا علمت الوفاة خيرًا لي . اللَّهُمَّ وأسألك خشيتك في الغيب والشهادة وأسألك كلمة الحق في الرضا والغضب وأسألك القصد في الفقر والغنى وأسألك نعيماً لا ينفد وأسألك قرة عين لا تنقطع وأسألك الرضاء بعد القضاء وأسألك برد العيش بعد الموت وأسألك لذة النظر إلـى وجهك والشوق إلـى لقائك في غير ضراء مضرة ولا فتنة مضلة. \n" +
                    "- اللَّهُمَّ فارج الهم كاشف الغم مجيب دعوة المضطرين رحمان الدنيا والآخرة ورحيمهما أنت ترحمني فارحمني برحمة تغنيني بها عن رحمة من سواك.\n" +
                    "- رب تقبل توبتي واغسل حوبتي وأجب دعوتي وثبت حجتي واهد قلبي وسدد لساني واسلل سخيمة قلبي. \n\n\n\n\n\n\n\n\n\n\n\n"



            ,
            "- { رَبَّنَا اغْفِرْ لَنَا ولإخْوَانِنَا الَّذِينَ سَبَقُونَا بِالإيمَانِ و لا تَجْعَلْ فِي قُلُوبِنَا غِلاًّ لِلَّذِينَ آمَنُوا رَبَّنَا إِنَّكَ رَءُوفٌ رَحِيمٌ } الحشر الآية : 10\n" +
                    "- { رَبَّنَا عَلَيْكَ تَوَكَّلْنَا وَإِلَيْكَ أَنَبْنَا وَإِلَيْكَ الْمَصِيرُ * رَبَّنَا لا تَجْعَلْنَا فِتْنَةً لِلَّذِينَ كَفَرُوا وَاغْفِرْ لَنَا رَبَّنَا إِنَّكَ أَنْتَ الْعَزِيزُ الْحَكِيمُ}الممتحنةآية4-5\n" +
                    "- { رَبَّنَا هَبْ لَنَا مِنْ أَزْوَاجِنَا وَذُرِّيَّاتِنَا قُرَّةَ أَعْيُنٍ وَاجْعَلْنَا لِلْمُتَّقِينَ إِمَاماً } الفرقان الآية : 74 .\n" +
                    "- { رَبِّ هَبْ لِي حُكْماً وَأَلْحِقْنِي بِالصَّالِحِينَ. وَاجْعَلْ لِي لِسَانَ صِدْقٍ فِي الْآخِرِينَ. وَاجْعَلْنِي مِنْ وَرَثَةِ جَنَّةِ النَّعِيمِ }الشعراء الآيات83-85.\n" +
                    "- { وَلا تُخْزِنِي يَوْمَ يُبْعَثُونَ . يَوْمَ لا يَنْفَعُ مَالٌ وَلا بَنُونَ . إِلَّا مَنْ أَتَى اللَّهَ بِقَلْبٍ سَلِيمٍ } الشعراء الآيات: 87-89 .\n" +
                    "- اللَّهُمَّ لا مانع لما بسطت ولا باسط لما قبضت ولا هادي لمن أضللت ولا مضل لمن هديت ولا معطي لما منعت ولا مانع لما أعطيت ولا مقرب لما باعدت ولا مباعد لما قربت .\n" +
                    "- اللَّهُمَّ مغفرتك أوسع من ذنوبي ورحمتك أرجى عندي من عملي .\n" +
                    "- اللَّهُمَّ لك الحمد بما بسطت في رزقنا وأظهرت أمننا وأحسنت معافاتنا ومن كل ما سألناك من صالح أعطيتنا فلك الحمد بالإسلام ولك الحمد بالأهل والمال ولك الحمد باليقين والمعافاة .\n" +
                    "- اللَّهُمَّ أسألك حبك وحب من يحبك وحب عمل يقربني إلـى حبك. \n" +
                    "- اللهم اغفر لي ذنوبي و خطاياي كلها اللهم أنعشني و اجبرني و اهدني لصالح الأعمال و الأخلاق فإنه لا يهدي لصالحها و لا يصرف سيئها إلا أنت .\n" +
                    "- اللَّهُمَّ وتقبل حسناتي وأسألك الدرجات العلى من الجنة .\n" +
                    "- رب أعني ولا تعن علي وانصرني ولا تنصر علي وامكر لي ولا تمكر علي واهدني ويسر هداي إلي وانصرني على من بغى علي.\n" +
                    "- اللَّهُمَّ فاطر السموات والأرض عالم الغيب والشهادة رب كل شيء ومليكه أشهد أن لا إله إلا أنت أعوذ بك من شر نفسي وشر الشيطان وشركه .\n" +
                    "- اللَّهُمَّ فالق الإصباح وجاعل الليل سكناً والشمس والقمر حسباناً اقض عني الدين وأغنني من الفقر وأمتعني بسمعي وبصري وقوتي في سبيلك. \n" +
                    "- اللَّهُمَّ قاتل الكفرة الذين يكذبون رسلك ويصدون عن سبيلك واجعل عليهم رجزك وعذابك إله الحق .\n\n\n\n\n\n\n\n"



            ,
            "- { رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ . } البقرة الآية : 201\n" +
                    "- { رَبَّنَا أَفْرِغْ عَلَيْنَا صَبْرًا وَثَبِّتْ أَقْدَامَنَا وَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ} البقرة الآية : 250\n" +
                    "- { رَبَّنَا تَقَبَّلْ مِنَّا إِنَّكَ أَنْتَ السَّمِيعُ الْعَلِيمُ * رَبَّنَا وَاجْعَلْنَا مُسْلِمَيْنِ لَكَ وَمِنْ ذُرِّيَّتِنَا أُمَّةً مُسْلِمَةً لَكَ وَأَرِنَا مَنَاسِكَنَا وَتُبْ عَلَيْنَا إنَّكَ أَنْتَ التَّوَّابُ الرَّحِيمُ} البقرة الآية : 127-128\n" +
                    "- { رَبَّنَا لا تُؤَاخِذْنَا إِنْ نَسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا رَبَّنَا وَلا تُحَمِّلْنَا مَا لا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلانَا فَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ} البقرة الآية : 286\n" +
                    "- {ر َبَّنَا لا تُزِغْ قُلُوبَنَا بَعْدَ إِذْ هَدَيْتَنَا وَهَبْ لَنَا مِنْ لَدُنْكَ رَحْمَةً إِنَّكَ أَنْتَ الْوَهَّابُ} آل عمران آية 8\n" +
                    "- اللَّهُمَّ أصلح لي ديني الذي هو عصمة أمري، وأصلح لي دنياي التي فيها معاشي ، وأصلح لي آخرتي التي فيها معادي، واجعل الحياة زيادة لي في كل خير ، واجعل الموت راحة لي من كل شر.\n" +
                    "- اللَّهُمَّ أعني ولا تعن علي وانصرني ولا تنصر علي وامكر لي ولا تمكر علي واهدني ويسر لي الهدى وانصرني على من بغى علي . \n" +
                    "- اللَّهُمَّ إني أعوذ برضاك من سخطك وبمعافاتك من عقوبتك وأعوذ بك منك لا أحصي ثناء عليك أنت كما أثنيت على نفسك .\n" +
                    "- اللَّهُمَّ إني عبدك ابن عبدك ابن أمتك ناصيتي بيدك ماضٍ فيِّ حكمك عدلٌ فيِّ قضاؤك أسألك بكل اسم هو لك سميت به نفسك أو أنزلته في كتابك أو علمته أحد من خلقك أو استأثرت به في علم الغيب عندك أن تجعل القرآن ربيع قلبي ، ونور صدري ، وجلاء حُزني ، وذهاب همِّي . \n" +
                    "- اللَّهُمَّ ألف بين قلوبنا ، وأصلح ذات بيننا ، واهدنا سبل السلام ، ونجنا من الظلمات إلى النور، وجنبنا الفواحش ما ظهر منها وما بطن ، وبارك لنا في أسماعنا وأبصارنا وقلوبنا وأزواجنا وذرياتنا ، وتب علينا إنك أنت التواب الرحيم ، واجعلنا شاكرين لنعمك مثنين بها عليك قابلين لها وأتمها علينا.\n" +
                    "- اللَّهُمَّ إنا نسألك عزائم مغفرتك ومنجيات أمرك والسلامة من كل إثم والغنيمة من كل بر والفوز بالجنة والنجاة من النار .\n" +
                    "- اللَّهُمَّ إنا نسألك من خير ما سألك منه نبيك محمد صلى الله عليه وسلم ونعوذ بك من شر ما استعاذ منه نبيك محمد صلى الله عليه وسلم وأنت المستعان وعليك البلاغ ولا حول ولا قوة إلا بالله.\n" +
                    "- اللَّهُمَّ أنت الأول فليس قبلك شيء . وأنت الآخر فليس بعدك شيء . وأنت الظاهر فليس فوقك شيء . وأنت الباطن فليس دونك شيء . اقض عنا الدين وأغننا من الفقر .\n\n\n\n\n\n\n\n\n\n"



            ,
            "- {رَبَّنَا إِنَّنَا آمَنَّا فَاغْفِرْ لَنَا ذُنُوبَنَا وَقِنَا عَذَابَ النَّارِ} آل عمران الآية : 16\n" +
                    "- { رَبَّنَا آمَنَّا بِمَا أَنْزَلْتَ وَاتَّبَعْنَا الرَّسُولَ فَاكْتُبْنَا مَعَ الشَّاهِدِينَ} آل عمران الآية : 53\n" +
                    "- { رَبَّنَا اغْفِرْ لَنَا ذُنُوبَنَا وَإِسْرَافَنَا فِي أَمْرِنَا وَثَبِّتْ أَقْدَامَنَا وَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ}آل عمران الآية : 147\n" +
                    "- { رَبَّنَا إِنَّنَا سَمِعْنَا مُنَادِيًا يُنَادِي للإيمَانِ أَنْ آمِنُوا بِرَبِّكُمْ فَآمَنَّا رَبَّنَا فَاغْفِرْ لَنَا ذُنُوبَنَا وَكَفِّرْ عَنَّا سَيِّئَاتِنَا وَتَوَفَّنَا مَعَ الأبْرَارِ * رَبَّنَا وَآتِنَا مَا َوعَدْتَنَا عَلَى رُسُلِكَ ولا تُخْزِنَا يَوْمَ الْقِيَامَةِ إِنَّكَ لا تُخْلِفُ ا لْمِيعَادَ} آل عمران الآية : 193-194 .\n" +
                    "- { رَبَّنَا ظَلَمْنَا أَنفُسَنَا وَإِنْ لَمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُونَنَّ مِنْ الْخَاسِرِينَ } الأعراف الآية: 126\n" +
                    "- { رَبَّنَا لا تَجْعَلْنَا فِتْنَةً لِلْقَوْمِ الظَّالِمِينَ * وَنَجِّنَا بِرَحْمَتِكَ مِنْ الْقَوْمِ الْكَافِرِينَ}يونس آية85-86\n" +
                    "- { رَبَّنَا أَفْرِغْ عَلَيْنَا صَبْرًا وَتَوَفَّنَا مُسْلِمِينَ } الأعراف الآية : 126\n" +
                    "- { رَبَّنَا آتِنَا مِنْ لَدُنْكَ رَحْمَةً وَهَيِّئْ لَنَا مِنْ أَمْرِنَا رَشَدًا } الكهف الآية : 10\n" +
                    "- اللَّهُمَّ أنت الملك لا إله إلا أنت أنا عبدك ظلمت نفسي واعترفت بذنبي فاغفر لي ذنوبي جميعًا لا يغفر الذنوب إلا أنت واهدني لأحسن الأخلاق لا يهدي لأحسنها إلا أنت واصرف عني سيئها لا يصرف عني سيئها إلا أنت لبيك وسعديك والخير كله في يديك والشر ليس إليك أنا بك وإليك تباركت وتعاليت أستغفرك وأتوب إليك. \n" +
                    "- اللَّهُمَّ أنت ربي لا إله إلا أنت خلقتني وأنا عبدك وأنا على عهدك ووعدك ما استطعت أبوء لك بنعمتك وأبوء لك بذنبي فاغفر لي فإنه لا يغفر الذنوب إلا أنت أعوذ بك من شر ما صنعت .\n" +
                    "- اللَّهُمَّ إني أسألك الثبات في الأمر والعزيمة على الرشد وأسألك شكر نعمتك وأسألك حسن عبادتك وأسألك قلبًا سليمًا وأسألك لسانًا صادقاً وأسألك خير ما تعلم وأعوذ بك من شر ما تعلم وأستغفرك لما تعلم إنك أنت علام الغيوب.\n" +
                    "- اللَّهُمَّ إني أسألك العفو والعافية في ديني ودنياي وأهلي ومالي .\n" +
                    "- اللَّهُمَّ إني أسألك الهدى والتقى والعفاف والغنى . \n" +
                    "- اللَّهُمَّ إني أسألك علمًا نافعًا ورزقًا طيبًا وعملاً متقبلا. \n" +
                    "- اللَّهُمَّ إني أسألك فعل الخيرات وترك المنكرات وحب المساكين وإذا أردت بعبادك فتنة فاقبضني إليك غير مفتون .\n" +
                    "- اللَّهُمَّ إني أسألك فواتح الخير وخواتمه وجوامعه وأوله وظاهره وباطنه والدرجات العلى من الجنة آمين .\n\n\n\n\n\n\n\n"



            ,
            "- { رَبَّنَا اغْفِر لي وَلِوَالِديَ وَلِلمُؤمِنِينَ يَومَ يَقُومُ الحِسَابُ} إبراهيم الآية : 41\n" +
                    "- { رَبَّنَا هَب لنا مِن أزواجنا وذُرياتنا قُرَّةَ أعيُنٍ واجعلنا للمُتقينَ إمَامًا} الفرقان الآية: 74\n" +
                    "- { رَبِّ هَب لي من لدُنكَ ذُريةً طَيبةً إنكَ سَميعُ الدُّعاءِ} آل عمران الآية : 38\n" +
                    "- { رَبِّ اجْعَلْنِي مُقِيمَ الصَّلاةِ وَمِنْ ذُرِّيَّتِي رَبَّنَا وَتَقَبَّلْ دُعَاءِ . رَبَّنَا اغْفِرْ لِي وَلِوَالِدَيَّ وَلِلْمُؤْمِنِينَ يَوْمَ يَقُومُ الْحِسَابُ }إبراهيم الآيتان: 40-41.\n" +
                    "- { سَمِعْنَا وَأَطَعْنَا غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ} البقرة الآية: 285.\n" +
                    "- اللَّهُمَّ إني أسألك من الخير كله عاجله وآجله ما علمت منه وما لم أعلم وأعوذ بك من الشر كله عاجله وآجله ما علمت منه وما لم أعلم وأسألك الجنة وما قرب إليها من قول أو عمل وأعوذ بك من النار وما قرب إليها من قول أو عمل وأسألك خير ما سألك عبدك ورسولك محمد وأعوذ بك من شر ما استعاذ منه عبدك ورسولك محمد صلى الله عليه وسلم .\n" +
                    "- اللَّهُمَّ إني أسألك نعيمًا لا يبيد وقرة عين لا تنفد ومرافقة النبي صلى الله عليه وسلم في أعلى جنة الخلد .\n" +
                    "- اللَّهُمَّ إني أسألك حبك وحب من يحبك والعمل الذي يبلغني حبك . \n" +
                    "- اللَّهُمَّ إني أعوذ برضاك من سخطك وأعوذ بعفوك من نقمتك وأعوذ بك منك لا مانع لما أعطيت ولا معطي لما منعت ولا ينفع ذا الجد منك الجد.\n" +
                    "- اللَّهُمَّ إني أعوذ بعزتك لا إله إلا أنت أن تضلني أنت الحي الذي لا يموت والجن والإنس يموتون .\n" +
                    "- اللَّهُمَّ إني أعوذ بك من البرص والجنون والجذام ومن سيئ الأسقام .\n" +
                    "- اللَّهُمَّ إني أعوذ بك من الجبن وأعوذ بك أن أرد إلى أرذل العمر وأعوذ بك من فتنة الدنيا وأعوذ بك من عذاب القبر .\n" +
                    "- اللَّهُمَّ إني أعوذ بك من الجوع فإنه بئس الضجيع وأعوذ بك من الخيانة فإنها بئست البطانة .\n" +
                    "- اللَّهُمَّ إني أعوذ برضاك من سخطك وبمعافاتك من عقوبتك وأعوذ بك منك لا أحصي ثناء عليك أنت كما أثنيت على نفسك . \n" +
                    "- اللَّهُمَّ إني أعوذ بك من الشقاق والنفاق وسوء الأخلاق .\n" +
                    "- اللَّهُمَّ إني أعوذ بك من الشيطان الرجيم وهمزه ونفخه ونفثه .\n" +
                    "- اللَّهُمَّ إني أعوذ بك من العجز والكسل والبخل والهرم والقسوة والغفلة و الذلة والمسكنة وأعوذ بك من الفقر والكفر والشرك والنفاق والسمعة والرياء وأعوذ بك من الصمم والبكم والجنون والبرص والجذام و سيئ الأسقام .\n" +
                    "- اللَّهُمَّ إني أعوذ بك من الهدم وأعوذ بك من التردي وأعوذ بك من الغرق والحرق والهرم وأعوذ بك أن يتخبطني الشيطان عند الموت وأعوذ بك من أن أموت في سبيلك مدبرًا وأعوذ بك من أن أموت لديغًا .\n" +
                    "- اللَّهُمَّ إني أعوذ بك من الفقر والقلة والذلة، وأعوذ بك من أن أَظْلِمَ أو أُظْلَمَ .\n" +
                    "- اللَّهُمَّ إني أعوذ بك من الهم والحزن ، والعجز والكسل ، والبخل والجبن ، وضلع الدين ، وغلبة الرجال .\n" +
                    "- اللَّهُمَّ أنت الأول لا شيء قبلك وأنت الآخر لا شيء بعدك أعوذ بك من كل دابة ناصيتها بيدك وأعوذ بك من الإثم والكسل ومن عذاب النار ومن عذاب القبر ومن فتنة الغنى وفتنة الفقر وأعوذ بك من المأثم والمغرم .\n" +
                    "- اللَّهُمَّ إني أعوذ بك من المأثم والمغرم .\n" +
                    "- اللَّهُمَّ إني أعوذ بك من زوال نعمتك وتحول عافيتك وفجاءة نقمتك وجميع سخطك .\n" +
                    "- اللَّهُمَّ إني أعوذ بك من جهد البلاء ، ودرك الشقاء ، وسوء القضاء ، وشماتة الأعداء .\n\n\n\n\n\n\n\n\n\n\n "



            ,  };
    TextView duaa_text;
    @Override
    public View onCreateView(LayoutInflater inflater, ViewGroup container,
                             Bundle savedInstanceState) {

        View view = inflater.inflate(R.layout.fragment_duaa,container, false);


        duaa_text=view.findViewById(R.id.duaa_text);
        duaa_text.setText(items[random]);
        return view;
    }
}